---
type: ImageBackgroundSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ImageBackgroundSettings

`Autodesk.Revit.DB.ImageBackgroundSettings` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | BackgroundImageFit | 2013 | `public BackgroundImageFit BackgroundImageFit { get ; set ; }` |
| Property | FilePath | 2013 | `public string FilePath { get ; set ; }` |
| Property | OffsetHeight | 2013 | `public double OffsetHeight { get ; set ; }` |
| Property | OffsetWidth | 2013 | `public double OffsetWidth { get ; set ; }` |